"""
练习3：写一个 Python 程序，在 utils/ 目录下生成一个名为"学生期末成绩.xlsx"的 Excel 文件，
里面有一张名为"期末考试成绩"的工作表，表头为"序号、姓名、语文、数学、英语、政治、历史、体育"，
并为小张，小刘，小李，小盖，小田5 位学生随机生成 0~100 的各科成绩；
如果文件已存在，先询问用户是否覆盖，若用户选择覆盖则覆盖，若用户选择不覆盖，则直接取消保存

整体流程
    保存/查询路径
    判断文件是否存在：存在---询问用户是否覆盖，根据用户回答操作，不存在--直接创建
    生成表格 表头跟姓名要根据提供的内容遍历，成绩要随机生成
    保存文件
"""


import openpyxl
import random
import os

# 定义一个目录 excel保存在哪
file_path = "utils/学生期末成绩.xlsx"

# 封装一个函数 生成表格 假设表头和学生姓名可以当作实参传入
def fs(title,names):
    wb = openpyxl.Workbook()
    sheet = wb.active
    sheet.title = "期末考试工作表"

    # 循环写入标题
    # title = ["姓名", "语文", "数学", "英语"]
    for i, v in enumerate(title):
        # 给第一行的1 2 3 4列加内容
        sheet.cell(row=1, column=i + 1, value=v)

    # 循环写入第一列的姓名
    # names = ["小田", "小白", "小盖", "小岳", "小 牛"]
    for i, v in enumerate(names):
        # 第二行开始 往后每一行第一列写入序号
        sheet.cell(i + 2, 1, i + 1)

        # 给第二行开始 往后的每一行的第二列写入姓名
        sheet.cell(i + 2, 2, v)

        # 循环列 从第三列开始
        for j in range(3, len(title) + 1):
            # 给每一行的第后面的列写入成绩
            sheet.cell(i + 2, j, random.randint(0, 100))

    # 保存数据
    wb.save("utils/学生期末成绩.xlsx")


# fs(["序号","姓名","语文","数学","英语","政治","历史","体育"],["小张","小刘","小李","小盖","小田"])
print("写入结束")


# 判断文件是否存在
# 存在
if os.path.exists(file_path):
    # 根据用户回答操作
    strs = input("文件存在，是否要覆盖：（y是/n否）")
    if strs == "y":
        fs(["序号", "姓名", "语文", "数学", "英语", "政治", "历史", "体育"], ["小张", "小刘", "小李", "小盖", "小田"])
        print("覆盖文件成功！")
    else:
        print("取消保存")
# 不存在
else:
    fs(["序号","姓名","语文","数学","英语","政治","历史","体育"],["小张","小刘","小李","小盖","小田"])
    print("新建文件成功！")





