# 定义几辆车，用变量 名字 颜色 价格
# car1_name = "奔驰"
# car1_color = "白色"
# car1_price = 100 # w
#
# car2_name = "宝马"
# car2_color = "黑色"
# car2_price = 10 # w
#
# car3_name = "凯迪拉克"
# car3_color = "蓝色"
# car3_price = 50 # w
# 变量太多管理起来困难
"""
面向对象的核心思想就是一句话：把“数据”和行为打包一起，形成一个模板，然后批量生成
    eg:类就是汽车的设计图，对象就是按照这个设计图造出来的一辆辆汽车，图纸只有一份
    但是车可以造出来无数辆

面向对象（Object-Oriented Programing）简称OOP，是一种编程思想，它把数据和操作方法组织在一起，
形成了“对象”
"""
# 比如list() tuple() dict() 都是类，可以通过类来创建列表/元组/字典
# 为什么可以通过list()创建一个列表？？？------->自己造一个类










