"""
    列表  list  []
    一个变量存储多个值
    元素：列表中每一项的内容都叫做列表的元素
    索引/下标： 列表中每一个元素都有对应的位置 索引从0开始
    列表取值赋值：通过索引的方式   列表[下标]
    获取列表中元素的个数：len(列表)
"""
# 传统的定义列表的方法
list1 = ["炸鸡","汉堡","麻辣烫","烤冷面"]
print(list1)
print(type(list1))
# 获取列表中元素的个数
print(len(list1))
# 取出来汉堡
print(list1[1])
# 下标用负数 从后边开始数第一个元素
print(list1[-1])

# 定义列表---构造器语法---不推荐
list2 = list((11,22,33))
list3 = list(range(1,11,2))
print(list2)
print(list3)

# 定义列表--生成式/推导式语法
list4 = [i**3 for i in range(1,11)]
print(list4)

print("=="*30)

list5 = ["张三","李四","王五","麻六","赵七"]
# 取出列表中第三个元素
print(list5[2])
# 列表切片  就是从列表中截取一段 生成新列表
# 语法  列表[开始下标:结束下标:步长]
# 获取的是列表中第二个到第三个元素
# 获取列表中下标为1到下标为3的元素
print(list5[1:3])
# 从下标为1的元素到最后一个元素
print(list5[1:])
# 前三个元素
print(list5[:3])
# 从头到尾 步长为
print(list5[::2])
# 列表反转
print(list5[::-1])

# 两个列表合并
print(list5+list1)
# 复制两份  重复列表
print(list5*2)

# 这个元素是否在该列表中  返回布尔值
print("王五" in list5)
print("王五" not in list5)

# 列表中的元素是数字
a1 = [1,2,3,888,999]
b1 = [4,5]
# False 是一个元素一个元素的比较，假如第一个元素比较出大小了，后边就不比了
print(a1 > b1)

c1 = ["hello","world"]
d1 = ["hzh"]
# ASCLL码值比较大小
print(c1 > d1)
# ord() 获取ASCLL码值
print(ord('e'))
print(ord('z'))

print("=="*30)

#  *变量 表示贪婪的收集多个元素 得到列表  只能有一个*
# 解包赋值
# *a,b,c = 1,2,3,4,5,6,7,8,9,11
# a,b,c = 1,2,3,4,5,6,7,8,9,11
a,b,*c = 1,2,3,4,5,6,7,8,9,11
print(a,b,c)
