# 冒泡排序 元素两两比较，如果前一个数大于后一个数就交换位置
# 两层循环实现 外层循环 循环多少次  内层循环比较大小
"""
    9 8 7 6 5 4
    第一次外层循环 每一轮循环都找到了一个比较大的值放在了最后
    i=0  j 5次 0-4
    8 9 7 6 5 4
    8 7 9 6 5 4
    8 7 6 9 5 4
    8 7 6 5 9 4
    8 7 6 5 4 9
    第二层外循环
    i=1 j 4次  0-3
    7 8 6 5 4
    7 6 8 5 4
    7 6 5 8 4
    7 6 5 4 8
    第三层外循环
    i=2 j 3次 0-2
    6 7 5 4
    6 5 7 4
    6 5 4 7
    第四层外循环
    i=3 j 2次 0-1
    5 6 4
    5 4 6
    第五层外循环
    i=4 j 1次 0
    4 5

"""
list1 = [9,8,7,6,5,4]
# 外层循环：轮数 n个元素只需要比较n-1轮  自己不用跟自己比较
for i in range(len(list1)-1):
    # 内层循环 相邻的两个值进行比较
    for j in range(len(list1)-1-i): # 记录还剩下几轮，所以需要减1
        # 如果前边一个数大于后边一个数 就交换位置
        if list1[j] > list1[j+1]:
            list1[j], list1[j+1] = list1[j+1], list1[j]

print(list1)