"""
    什么是变量？可以理解为一个存东西的小盒子，将来把东西存到这个盒子中的过程叫赋值
    定义变量
        变量名 = 值
    变量名的命名规则：
        变量名必须是字母或者下划线开头，不能用特殊字符和数字开头
        大小写区分明确，a和A是两个变量
        禁止用关键字和保留字（系统已经用过的已经存在的）作为变量名 比如if  class  def  for等等
        建议尽量见名知意  两个单词之间可以用下划线链接   比如说学生名  student_name
"""

# 现在就是定义了一个名字叫str的盒子  将这句话放到了盒子里边  后期如果我们想用这句话  直接喊这个盒子名即可
str = "李子豪得了一种病，运动过敏症"
# 使用的时候直接去拿盒子名称
print(str)
print("李子豪得了一种病，运动过敏症")

# 给变量重新赋值
str = "想变瘦必须运动不过敏"
print(str)

# 多变量赋值  多个变量一起赋值不同的数据  等号左右两边的数量要一致
aa,bb,cc = 1,222,3
print(aa,bb,cc)

# 链式赋值  多个变量赋值同一个值
# e f g三个值是相等的
e = f = g = 111
print(e,f,g)

# input() 从键盘上输入内容
# int() 定义的是整数

# num1 = int(input("请输入num1:"))
# num2 = int(input("请输入num2:"))
# # 加法运算
# print(num1+num2)

# 浮点数精度问题   计算机内部是用二进制来存储所有数据的，我们平常使用的十进制小数在转换成二进制的时候 无法被精确表示，计算机的内存是有限的，只能“截断”并存储他的相似值
print(0.1+0.2,"www")
# 值不一样 是因为计算顺序不同导致的四舍五入误差累积不同
print(0.1+0.2+0.3)
print(0.3+0.1+0.2)
print(0.3+0.2+0.1)

# 如何解决
# 1.先转为整数再计算
# 0.1===》1  0.2===》2  0.3===》3   每一个都乘以了10，整数相加的和再除以10
# 2.round(数字，保留的小数位数) 对数字做四舍五入  第二个参数如果不写 默认取整数
print(round(0.3+0.1+0.2,1))
# 3.decimal模块 高精度模块  银行项目 需要先引入
