# 第一种 % 占位符 了解就行
# %s输出字符串   %d输出整数   %f输出小数--默认六位
name = "小明"
age = 18
height = 1.751234567

# 单个变量   想输出  我的名字是小明
print("我的名字是%s" % name)

# 多个变量（用括号括起来）  想输出 我叫小明，今年18岁，身高1.751234米
print("我叫%s,今年%d岁,身高%f米" % (name,age,height))

aaa = 3.1415926
# %.2f  保留两位小数
print("圆周率%.2f" % aaa)

# 第二种 {}占位 format函数进行数据填充  了解
name1 = "张三三"
age1 = 22
print("我叫{}，今年{}岁".format(name1,age1))
# 也可以指定顺序
print("我叫{0}，今年{1}岁，{0}喜欢唱歌，{0}也喜欢敲代码".format(name1,age1))
# 保留几位小数
pi = 3.141592687878
print("圆周率保留两位小数是{:.2f}".format(pi))


# 第三种 *****推荐写法  f-string
# 语法 f"{变量}"  :.2f保留两位小数
print(f"我叫{name}，今年{age}岁，身高{height:.2f}米")

print("=="*20)
# 补充
c = 3.141592687878
num1 = -1
abc = 123
# 1 带正负号输出  +在输出的时候强制给正数输出一个加号
print(f"{c:+.2f}")
print(f"{num1:+.2f}")
# 2.直接取整数 不带小数
print(f"{c:.0f}")
# 3.左边补0，凑够10位
print(f"{abc:0>10d}")
# 4.右边补x 凑够10位
print(f"{abc:x<10}")
# 5.左边补空格，凑够10位
print(f"{abc:>10d}")