# 1.假设你现在已经入职了，月薪13k,每年涨幅5%，问50年之后 你的月薪是多少？
# money 变量代表月薪
money = 13000
money1 = money * (1+0.05)**50
print(f"五十年之后的月薪是{money1}元")
"""
    题意有歧义
    理解一：每一年是在前一年的基础上 调整涨幅
    1 m=13000=13000
    2 m=m+m*0.05=13000*1.05=13650
    3 m=m+m*0.05=13000*1.05*1.05=14332.5
    4 m=13000*1.05*1.05*1.05
    。。。

    理解二：每年涨幅是在初始定岗薪资13000基础上去长
    每年就增加13000*0.05=650元
"""
money2 = 13000
money2 += money2 * 0.05 * 50
print(f"五十年之后的月薪是{money2}元")

# 2.假设你现在想快速学完AI全栈+Agent智能体开发，连续学习了89个小时，计算一下这是多少天零着多少小时？
time = 89
day = 89 // 24
hours = 89 % 24
print(f"连续学了{day}天{hours}小时")

# 3.给你一个四位数 6789  分别取出来个位数 十位数 百位数 千位数
num = 6789
gw = num % 10
sw = num // 10 % 10
bw = num // 100 % 10
qw = num // 1000
print(f"{num}的个位数是{gw},十位数是{sw},百位数是{bw},千位数是{qw}")

# 4.让用户输入圆的半径 输出圆的周长和面积 Π就取3.14即可
r = int(input("请输入圆的半径:"))
zc = 2 * 3.14 * r
area = 3.14 * r ** 2
print(f"圆的周长是{zc},面积是{area}")

# 5.让用户输入身高和体重，计算一下他的BMI指数
# 你的身高是？米，你的体重是？千克，你的BMI指数是？
h = float(input("请输入您的身高（单位：米）:"))
w = float(input("请输入您的体重（单位：kg）:"))
bmi = w / (h ** 2)
print(f"您的身高是{h}米，您的体重是{w}kg，您的bmi指数是{bmi}")