"""
    while 循环
        定义计数器/累加器  i=0
        写循环条件 注意这个条件不能永久成立，当条件不成立的时候方便跳出循环  以免变成死循环
        循环体也就是重复要执行的代码
        计数器自增  防止死循环
"""
# 1.定义计数器/累加器
i = 0
# 2.写循环条件  只要i在0-100之间就一直循环
while 0<=i<=100:
    # 3.循环体--自己的逻辑--重复执行的代码
    print(i,end="-")
    # 4.计数器自增 +1  如果此处不加1，i一直是原来的数
    i+=1
print("")

# 求1-100之间的偶数和
# 和
result = 0
# 计数器
i = 1
# 循环条件
while 1<=i<=100:
    if i % 2 == 0:
        result += i
    #计数器自增
    i+=1
print(f"1-100之间的偶数和是{result}")


# 小功能
while True:
    content = input("你认为我优秀就输入yes:")
    if content == "yes":
        print("很好，你真有眼光")
        break