"""
    函数的参数：函数名后边括号里边的变量就是参数，目的是当函数在调用的时候，可以对用户传进来的值进行操作
    传参/传值：用户在调用函数的时候给变量进行赋值 这个过程

    定义函数
    def 函数名(形参1,形参2...形参n):
        函数体

    调用函数
    函数名(实参1,实参2...实参n)

    形参：形式上的参数，相当于定义了一个没有赋值的变量
    实参：实际传进去的参数，就是要给形参赋的具体的值
"""
from os import name

# 1.位置参数(必传参数) 函数在调用的时候 必须按照位置和顺序传递实参  个数必须和定义的时候保持一致
# 定义函数
# def get_Sum(a,b):
#     print(a+b)
#
# # 调用函数
# get_Sum(1,2)
#
# # 形参和实参要一一对应
# """
#     def fn(a,b,c):
#         print(a,b,c)
#     fn(True,99)
# """
#
# # 2.默认参数（给参数设置默认值，不传参就直接用默认值）
# # 定义函数的时候可以直接给形参设置默认值
# def fn(a,b,c="默认参数"):
#     print(a,b,c)
#
# fn(1,2,3)
# fn(11,22)
#
# # 3.关键字参数 调用的时候指定参数名字
# def fn1(name,age):
#     print(f"名字是{name},年龄是{age}")
# # 位置传参
# # fn1("张三三",66)
# # 关键字传参  参数名=值  顺序可以随便写  不用管定义时的顺序
# fn1(name="张三三",age=18)
# fn1(age=188,name="张三")
#
# # 如果想把普通的位置参数和关键字参数混合使用
# # fn1(name = "李四1", 166) # 这里错了，关键字参数只能在位置参数后面
# fn1("李四2", age = 188)

'''
4.*args 可变位置参数，把多的数变成元组包括进去——> 元组
**kwargs 可变关键字参数，接受任意多个关键字参数，把多的参数变成字典包括进去，要指定键值对——> 字典
'''
def fn2(a, b, *args, c = 100, **kwargs):
    print(a, b)
    print(args)
    print(c)
    print(kwargs)
fn2(1, 2, 3, 4, 5, 6, 7, c = 77, name = "老蕾", age = 20)
"""
    此处应要在7后面单独给c赋上关键字参数，因为如果不指定后面就还会变成args的一部分
"""

def f(a, *args, b):
    print(a, args, b)

# f(1, 2, 3, 4)
# f(1, 2, 3, b=4)
"""
此处第一个调用错误，因为1后面的实参为args的数了，
b既没有默认参数也没有传入参数，而函数打印确打印了b
"""




